app/Models/ModelResidence.php

    function showdata(){
        $builder = $this->db->table("residence as r");
        $builder->select('r.*, a.name as area_name, c.name as category_name');
        $builder->join('area as a', 'r.area_id = a.id');
        $builder->join('category as c', 'r.category_id = c.id');
        $data = $builder->get()->getResult();
---
SELECT `r`.*, `a`.`name` as `area_name`, `c`.`name` as `category_name`
FROM `residence` as `r`
JOIN `area` as `a` ON `r`.`area_id` = `a`.`id`
JOIN `category` as `c` ON `r`.`category_id` = `c`.`id`

    function savedata($data){
        return $this->db->table('residence')->insert($data);
---
INSERT INTO `residence` (`name`, `category_id`, `area_id`, `desc`, `sqm`, `image_url`) VALUES ('BSD', '3', '1', 'BSD adalah sebuah residence dengan kualitas lingkungan yang nyaman', '30', 'https://www.bsdcity-development.com/app/uploads/sites/115/2020/11/bsd-city-cluster-jadeite-residence.jpg')

    function deletedata($id){
        return $this->db->table('residence')->delete(['id' => $id]);
---
DELETE FROM `residence`
WHERE `id` = '12'

    function get($id){
        return $this->db->table('residence')->getWhere(['id' => $id]);
---
SELECT *
FROM `residence`
WHERE `id` = '13'

    function editdata($id, $data){
        return $this->db->table('residence')->update($data, ['id' => $id]);
---
UPDATE `residence` SET `name` = 'BSD', `category_id` = '3', `area_id` = '1', `desc` = 'BSD adalah sebuah residence dengan kualitas lingkungan yang nyaman', `sqm` = '30', `image_url` = 'https://img.beritasatu.com/cache/investor/798x449-2/1635587182.jpg'
WHERE `id` = '13'